kfilipcic/ESP8266-smart-water-heater/platformIOproject/src/main.cpp
#include <Arduino.h>
#include <ESP8266WebServer.h>
#include <ESP8266WiFi.h>
#include <NTPClient.h>
#include <WebParser.h>
#include <WiFiUdp.h>
#include <time.h>

#include "secrets.h"  // Contains your network ssid and password

#define bufferMax 10000
#define queryMax 10000
#define RULE_FIRST_PARAM_INDEX_START 18
#define RULE_URL_STRING_MAX_LEN 100
#define ROOM_TEMP_MIN 19
#define ROOM_TEMP_MAX 26
#define WATER_TEMP_MIN 20
#define WATER_TEMP_MAX 80
#define MAX 100
#define ROOM_TEMP_DEFAULT 21
#define MOISTURE_DEFAULT 30
#define CHARMAX 30

struct wHeater {
    char name[MAX];
    float temp;
    float room_temp;
    uint8 state;
};

struct AC {
    char name[];
    float temp;
    float humidity;
    int tempLevel = 21;
    uint8 state;
    uint8 mode;
    uint8 fan;
    bool swing;
    bool direct;
    bool sleep;
};

struct Heater {
    char name[];
    float temp;
    float humidity;
    uint8 state;
};

int bufferSize;
char queryBuffer[bufferMax];
char param_value[queryMax];
unsigned long arduinoSession = 1;

WebParser webParser;
WiFiClient client;

const char *ssid = SECRET_SSID;
const char *pass = SECRET_ROUTER_PASSWORD;

const char *user = SECRET_AUTH_USER;
const char *password = SECRET_AUTH_PASSWORD;

WiFiServer server(80);

// Needed for NTP server
WiFiUDP ntpUDP;
NTPClient timeClient(ntpUDP, "hr.pool.ntp.org");

// Something for HTTP request
String header;

// Defining the IN1 pin for the relay
// 5 is actually D1 on the ESP8266-12E
int in1 = 5;

const char *deviceName = "pc";

// Defining time for the site request
// Current time
unsigned long startTime = millis();
unsigned long currentTime;
// Define timeout time in milliseconds (example: 2000ms = 2s)
const long timeoutTime = 20000;

// One second counter for the clock
unsigned long startClock = millis();
unsigned long currentTimeClock;
const long timeoutTimeClock = 1000;

// For clock
boolean getTimeFromServer =
    true;  // true when x hours pass, then the time updates from the NTP server
int hour = 0, minute = 0, second = 0, day = 0, month = 0, year = 0;
int daysOfMonth[12] = {31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31};
NTPClient::paup date_struct;  // Used to extract day, month and year

long long int startTimeMs = -1;
long long int startTimeHHmmMs = -1;  // Start time without the date in ms
long long int endTimeHHmmMs = -1;    // End time without the date in ms

long long int curr_time_ms = -1;

char queryStore[RULE_URL_STRING_MAX_LEN];
char firstParam[RULE_URL_STRING_MAX_LEN];
const int start_index = RULE_FIRST_PARAM_INDEX_START;

float tempStates[] = {0, .1, -.1};

struct wHeater water_heater[2];
struct AC ac[2];
struct Heater heater[2];

String httpHeader = String("HTTP/1.1 200 OK\r\n") +
                    "Content-Type: text/html\r\n" + "Connection: close\r\n";

// String water_heater = "1";
String processor();
void serverSection();
void water_heater_check_state();
void water_heater_switcher();
void handleLogin();
void secureRedirect();
void parseReceivedRequest(WiFiClient client);
boolean loggedIn();

void updateNTPTime() {
    timeClient.begin();
    timeClient.update();
    // second = timeClient.getSeconds();
    minute = timeClient.getMinutes();
    hour = timeClient.getHours() + 2;  // Adding 1 hour because UTC+1
    if (hour >= 24) {
        hour = 1;
        day++;
    }
    date_struct = timeClient.getFormattedDate();
    day = date_struct.day;
    month = date_struct.month;
    year = date_struct.year;
    Serial.print(date_struct.dateStr + " ");
    Serial.print(timeClient.getFormattedTime() + " ");
    Serial.println("Getting time from NTP server...");
}

void setup() {
    // Serial.begin(115200);
    Serial.begin(9600);

    for (int i = 0; i < 2; i++) {
        String wName = "water_heater_" + String(i + 1);
        char wname[CHARMAX];
        wName.toCharArray(wname, CHARMAX);
        strcpy(water_heater[i].name, wname);
        water_heater[i].room_temp = ROOM_TEMP_DEFAULT;
        water_heater[i].temp = 50;
        water_heater[i].state = 1;

        String acName = "ac_" + String(i + 1);
        char acname[CHARMAX];
        acName.toCharArray(acname, CHARMAX);
        strcpy(ac[i].name, acname);

        ac[i].temp = ROOM_TEMP_DEFAULT;
        ac[i].humidity = MOISTURE_DEFAULT;
        ac[i].state = 1;
        ac[i].direct = false;
        ac[i].swing = false;
        ac[i].sleep = false;
        ac[i].fan = 0;
        ac[i].mode = 0;
        ac[i].tempLevel = ROOM_TEMP_DEFAULT;

        String hName = "heater_" + String(i + 1);
        char hname[CHARMAX];
        hName.toCharArray(hname, CHARMAX);
        strcpy(heater[i].name, hname);
        heater[i].temp = ROOM_TEMP_DEFAULT;
        heater[i].humidity = MOISTURE_DEFAULT;
        heater[i].state = 1;
    }

    // Making the relay pin output
    pinMode(in1, OUTPUT);
    digitalWrite(in1, HIGH);

    delay(10);

    Serial.println("Connecting to ");
    Serial.println(ssid);

    WiFi.disconnect();  // Prevent connecting to wifi based on previous
                        // configuration

    WiFi.hostname(deviceName);  // DHCP Hostname (useful for finding device for
                                // static lease)
    WiFi.config(staticIP, dns, gateway, subnet);
    WiFi.begin(ssid, pass);
    WiFi.mode(WIFI_STA);

    while (WiFi.status() != WL_CONNECTED) {
        delay(500);
        Serial.print(".");
    }

    Serial.println("WiFi connected");
    Serial.print("IP address:");
    Serial.println(WiFi.localIP());
    Serial.println(WiFi.subnetMask());
    Serial.println(WiFi.gatewayIP());

    // configTime(3 * 3600, 0, "pool.ntp.org", "time.nist.gov");

    server.begin();

    updateNTPTime();  // Getting the time from the NTP server for the first time
    startClock = millis();  // Starting to count our local clock
}

void relaySwitcher() {
    if ((((hour > 0 && hour < 25) || (hour >= 0 && hour <= 7))) &&
        digitalRead(in1) == 1) {  //&& //second % 2 == 0) {
        // If it's between 22:00 and 7:00, switch ON the relay
        digitalWrite(in1, LOW);
    } else if (digitalRead(in1) == 0) {
        // If not, switch OFF the relay
        digitalWrite(in1, HIGH);
    } else {
        digitalWrite(in1, HIGH);
    }
}

void give_temperature(float &temp, float low, float high) {
    temp = (temp > low && temp < high) ? temp + tempStates[random(3)] : temp;
    Serial.println(temp);
}

