kfilipcic/ESP8266-smart-water-heater/platformIOproject/src/main.cpp
void theClock() {
    // T h e    c l o c k :
    currentTimeClock = millis();
    // If a second passed, update the time
    if ((currentTimeClock - startClock >= timeoutTimeClock)) {
        second = ((second) + 1);
        if (!(second % 60)) {
            second = 0;
            minute = ((minute) + 1);
            if (!(minute % 60)) {
                minute = 0;
                hour++;
                getTimeFromServer = true;
                if (!(hour % 24)) {
                    hour = 0;
                    day = ((day) + 1);
                    if (!(day % daysOfMonth[month])) {
                        day = 0;
                        month = ((month) + 1);
                        if (!(month % 12)) {
                            month = 0;
                            year++;
                            if (!(year % 4))
                                daysOfMonth[1] = 29;
                            else
                                daysOfMonth[1] = 28;
                            if (!(year % 100)) daysOfMonth[1] = 28;
                        }
                    }
                }
            }
        }
        startClock = currentTimeClock;
    }
    if (getTimeFromServer) {
        updateNTPTime();
        getTimeFromServer = false;
    }
}

void manage_rules() {
    curr_time_ms = system_mktime(year, month, day, hour, minute, second) * 1000;

    if (startTimeMs >= 0 && startTimeHHmmMs >= 0 && endTimeHHmmMs >= 0) {
        // Serial.println("G");
        // Serial.printf("startTimeMs: %lld\n curr_time_ms %lld\n", startTimeMs,
        // curr_time_ms);
        if (startTimeMs <= curr_time_ms) {
            long long int curr_daytime_ms =
                hour * 3600000 + minute * 60000 + second * 1000;
            if (startTimeHHmmMs < endTimeHHmmMs) {
                // Serial.println("N");
                if (curr_daytime_ms > startTimeHHmmMs &&
                    curr_daytime_ms < endTimeHHmmMs && digitalRead(in1)) {
                    // Serial.println("RADI");
                    digitalWrite(in1, LOW);
                } else if (!digitalRead(in1)) {
                    // Serial.println("S");
                    digitalWrite(in1, HIGH);
                }
            } else {
                // Serial.println("g");
                long long int curr_date_ms =
                    system_mktime(year, month, day, 0, 0, 0) * 1000;
                if (curr_time_ms > startTimeHHmmMs &&
                    curr_daytime_ms < (curr_date_ms + endTimeHHmmMs) &&
                    digitalRead(in1))
                    digitalWrite(in1, LOW);
                else if (!digitalRead(in1)) {
                    // Serial.println("e");
                    digitalWrite(in1, HIGH);
                }
            }
        } else if (!digitalRead(in1)) {
            // Serial.println("n");
            digitalWrite(in1, HIGH);
        }
    }
}

void manage_temperature() {
    String types[] = {"water_heater", "heater", "ac"};
    unsigned long currTime = millis();

    if ((currTime - startTime) >= timeoutTime) {
        for (int i = 0; i < 3; i++) {
            for (int index = 0; index < 2; index++) {
                String dev_str;
                float *temp;
                float min = 0;
                float max = 0;
                char type[CHARMAX];

                (types[i]).toCharArray(type, CHARMAX);

                if (strstr(type, "water_heater") != NULL) {
                    temp = &(water_heater[index].temp);
                    dev_str = "water_heater";
                    min = WATER_TEMP_MIN;
                    max = WATER_TEMP_MAX;
                } else if (strstr(type, "heater") != NULL) {
                    temp = &(heater[index].temp);
                    dev_str = "heater";
                    min = ROOM_TEMP_MIN;
                    max = ROOM_TEMP_MAX;
                } else if (strstr(type, "ac") != NULL) {
                    temp = &(ac[index].temp);
                    dev_str = "ac";
                    min = ROOM_TEMP_MIN;
                    max = ROOM_TEMP_MAX;
                }

                give_temperature(*temp, min, max);

                startTime = currTime;
            }
        }
    }
}

void loop() {
    theClock();
    manage_rules();

    // Serial.println("start of loop");
    client = server.available();
    Serial.println(client.available());

    if (client) {
        Serial.println("client available");
        boolean currentLineIsBlank = true;
        bufferSize = 0;

        while (client.connected()) {
            theClock();
            manage_rules();
            if (client.available()) {
                theClock();
                manage_rules();

                char c = client.read();

                if (bufferSize < bufferMax) queryBuffer[bufferSize++] = c;
                if (c == '\n' && currentLineIsBlank) {
                    parseReceivedRequest(client);
                    bufferSize = 0;
                    webParser.clearBuffer(queryBuffer, bufferMax);
                    break;
                }
                if (c == '\n') {
                    currentLineIsBlank = true;
                } else if (c != '\r') {
                    currentLineIsBlank = false;
                }
            }
            // yield();
        }
        // delay(10);

        client.flush();
        client.stop();
    }
    manage_rules();
    manage_temperature();
}

void check_state(char type[], int index) {
    if (strstr(type, "water_heater") != NULL)
        client.println("{'water_heater': '" +
                       String(water_heater[index].state) + "'}");
    else if (strstr(type, "heater") != NULL)
        client.println("{'heater': '" + String(heater[index].state) + "'}");
    else if (strstr(type, "ac") != NULL)
        client.println("{'ac': '" + String(ac[index].state) + "'}");
}

void check_bool(char type[], bool &state) {
    if (state) {
        client.println("{'" + String(type) + "': '1'}");
    } else {
        client.println("{'" + String(type) + "': '0'}");
    }
}

