kfilipcic/ESP8266-smart-water-heater/platformIOproject/src/main.cpp
void switch_bool(char type[], bool &state) {
    state = !state;
    if (state) {
        client.println("{'" + String(type) + "': '1'}");
    } else {
        client.println("{'" + String(type) + "': '0'}");
    }
}

void check_ac_mode(uint8 mode) {
    client.println("{'ac': '" + String(mode) + "'}");
}

void check_ac_fan(uint8 fan) {
    client.println("{'ac': '" + String(fan) + "'}");
}

void switch_ac_mode(uint8 &mode) {
    mode = (mode+1) % 5;
    client.println("{'ac': '" + String(mode) + "'}");
}

void switch_ac_fan(uint8 &fan) {
    fan = (fan+1) % 4;
    client.println("{'ac': '" + String(fan) + "'}");
}

void check_ac_temp(int &temp) {
    client.println("{'ac': '" + String(temp) + "'}");
}

void ac_temp_up(int &temp) {
    if (temp < 30) temp++;
    client.println("{'ac': '" + String(temp) + "'}");
}

void ac_temp_down(int &temp) {
    if (temp > 17) temp--;
    client.println("{'ac': '" + String(temp) + "'}");
}

void switcher(char type[], int index) {
    uint8 *state;
    String dev_str;

    if (strstr(type, "water_heater") != NULL) {
        state = &(water_heater[index].state);
        dev_str = "water_heater";
    } else if (strstr(type, "heater") != NULL) {
        state = &(heater[index].state);
        dev_str = "heater";
    } else if (strstr(type, "ac") != NULL) {
        state = &(ac[index].state);
        dev_str = "ac";
    } else {
        client.println("Device type not recognized");
        return;
    }

    switch (*state) {
        case 0:
            *state = 1;
            digitalWrite(in1, HIGH);
            break;
        case 1:
            *state = 0;
            digitalWrite(in1, LOW);
            break;
    }

    client.println("{'" + dev_str + "': '" + String(*state) + "'}");
}

void get_current_value(String deviceString, double tempValue) {
    // return random number between 20 and 90 (representing degrees in Celsius)
    // in JSON format
    client.println("{'" + deviceString + "': '" + String(tempValue) + "'}");
}

void renderHtmlPage(char *page, WiFiClient client) {
    String pagestr = (String)page;

    // Serial.println(pagestr);

    String time = String(hour) + ":" + String(minute) + ":" + String(second);
    String date = String(day) + "." + String(month) + "." + String(year);

    theClock();

    client.println(httpHeader);

    if (pagestr.indexOf("logtut.html") != -1) {
        client.println(F("<!DOCTYPE html><html><head>"));
        client.println(F(
            "<meta name='viewport' content='user-scalable=no, initial-scale=1, "
            "maximum-scale=1, minimum-scale=1, width=device-width' />"));
        client.println(F("<title>Smart home login</title>"));
        client.println(F(
            "<style>#loginform{width: 90%;background: #EEE;box-shadow: 2px 2px "
            "10px #999;padding: 10px;display: block;margin: 0 auto 0 auto;}"));
        client.println(F(
            "@media screen and (min-width: 32em) {#loginform{width: 400px;}}"));
        client.println(
            F("</style><link rel='icon' "
              "href='data:,'></head><body><div><h1>Login</h1></div>"));
        client.println(F("<form id='loginform' action='/login' method='GET'>"));
        client.println(
            F("<input type='text' name='username' placeholder='Username'>"));
        client.println(
            F("<input type='password' name='password' autocomplete='on' "
              "placeholder='Password'>"));
        client.println(
            F("<br><input type='submit' value='Submit'></form><p><a "
              "href='entry.htm'>entry</a></p></body></html>"));
    }

    else if (pagestr.indexOf("entry.html") != -1) {
        client.println("<html><body></form><h1>Time: " + time +
                       "</h1></br><h1>Date: " + date +
                       "</h1></br></body></html>");
    } else if (pagestr.indexOf("water_heater_1_check") != -1) {
        check_state("water_heater", 0);
    } else if (pagestr.indexOf("water_heater_2_check") != -1) {
        check_state("water_heater", 1);
    } else if (pagestr.indexOf("water_heater_1_switch") != -1) {
        switcher("water_heater", 0);
    } else if (pagestr.indexOf("water_heater_2_switch") != -1) {
        switcher("water_heater", 1);
    } else if (pagestr.indexOf("heater_1_check") != -1) {
        check_state("heater", 0);
    } else if (pagestr.indexOf("heater_2_check") != -1) {
        check_state("heater", 1);
    } else if (pagestr.indexOf("heater_1_switch") != -1) {
        switcher("heater", 0);
    } else if (pagestr.indexOf("heater_2_switch") != -1) {
        switcher("heater", 1);
    } else if (pagestr.indexOf("ac_1_check") != -1) {
        check_state("ac", 0);
    } else if (pagestr.indexOf("ac_1_swing_check") != -1) {
        check_bool("ac", ac[0].swing);
    } else if (pagestr.indexOf("ac_1_sleep_check") != -1) {
        check_bool("ac", ac[0].sleep);
    } else if (pagestr.indexOf("ac_1_direct_check") != -1) {
        check_bool("ac", ac[0].direct);
    } else if (pagestr.indexOf("ac_1_swing_switch") != -1) {
        switch_bool("ac", ac[0].swing);
    } else if (pagestr.indexOf("ac_1_sleep_switch") != -1) {
        switch_bool("ac", ac[0].sleep);
    } else if (pagestr.indexOf("ac_1_direct_switch") != -1) {
        switch_bool("ac", ac[0].direct);
    } else if (pagestr.indexOf("ac_2_swing_check") != -1) {
        check_bool("ac", ac[1].swing);
    } else if (pagestr.indexOf("ac_2_sleep_check") != -1) {
        check_bool("ac", ac[1].sleep);
    } else if (pagestr.indexOf("ac_2_direct_check") != -1) {
        check_bool("ac", ac[1].direct);
    } else if (pagestr.indexOf("ac_2_swing_switch") != -1) {
        switch_bool("ac", ac[1].swing);
    } else if (pagestr.indexOf("ac_2_sleep_switch") != -1) {
        switch_bool("ac", ac[1].sleep);
    } else if (pagestr.indexOf("ac_2_direct_switch") != -1) {
        switch_bool("ac", ac[1].direct);
    } else if (pagestr.indexOf("ac_2_check") != -1) {
        check_state("ac", 1);
    } else if (pagestr.indexOf("ac_1_switch") != -1) {
        switcher("ac", 0);
    } else if (pagestr.indexOf("ac_2_switch") != -1) {
        switcher("ac", 1);
    } else if (pagestr.indexOf("updateTime") != -1) {
        updateNTPTime();
    } else if (pagestr.indexOf("ac_1_mode_check") != -1) {
        check_ac_mode(ac[0].mode);
    } else if (pagestr.indexOf("ac_2_mode_check") != -1) {
        check_ac_mode(ac[1].mode);
    } else if (pagestr.indexOf("ac_1_mode_switch") != -1) {
        switch_ac_mode(ac[0].mode);
    } else if (pagestr.indexOf("ac_2_mode_switch") != -1) {
        switch_ac_mode(ac[1].mode);
    } else if (pagestr.indexOf("ac_1_fan_check") != -1) {
        check_ac_fan(ac[0].mode);
    } else if (pagestr.indexOf("ac_2_fan_check") != -1) {
        check_ac_fan(ac[1].mode);
    } else if (pagestr.indexOf("ac_1_fan_switch") != -1) {
        switch_ac_fan(ac[0].mode);
    } else if (pagestr.indexOf("ac_2_fan_switch") != -1) {
        switch_ac_fan(ac[1].mode);
    } else if (pagestr.indexOf("ac_1_temp_check") != -1) {
        check_ac_temp(ac[0].tempLevel);
    } else if (pagestr.indexOf("ac_2_temp_check") != -1) {
        check_ac_temp(ac[1].tempLevel);
    } else if (pagestr.indexOf("ac_1_temp_up") != -1) {
        ac_temp_up(ac[0].tempLevel);
    } else if (pagestr.indexOf("ac_2_temp_up") != -1) {
        ac_temp_up(ac[1].tempLevel);
    } else if (pagestr.indexOf("ac_1_temp_down") != -1) {
        ac_temp_down(ac[0].tempLevel);
    } else if (pagestr.indexOf("ac_2_temp_down") != -1) {
        ac_temp_down(ac[1].tempLevel);
    } else if (pagestr.indexOf("water_heater_1_temperature") != -1) {
        get_current_value(
            "water_heater",
            water_heater[0].temp);  // temperature value is random and between
                                    // 20 and 90 degrees Celsius
    } else if (pagestr.indexOf("water_heater_2_temperature") != -1) {
        get_current_value(
            "water_heater",
            water_heater[1].temp);  // temperature value is random and between
                                    // 20 and 90 degrees Celsius
    } else if (pagestr.indexOf("water_heater_1_room_temperature") != -1) {
        get_current_value("water_heater", water_heater[0].room_temp);
    } else if (pagestr.indexOf("heater_1_temperature") != -1) {
        get_current_value("heater", heater[0].temp);
    } else if (pagestr.indexOf("heater_2_temperature") != -1) {
        get_current_value("heater", heater[0].temp);
    } else if (pagestr.indexOf("ac_1_temperature") != -1) {
        get_current_value("ac", ac[0].temp);
    } else if (pagestr.indexOf("ac_2_temperature") != -1) {
        get_current_value("ac", ac[0].temp);
    } else if (pagestr.indexOf("heater_1_humidity") != -1) {
        get_current_value("heater", heater[0].humidity);
    } else if (pagestr.indexOf("heater_2_humidity") != -1) {
        get_current_value("heater", heater[0].humidity);
    } else if (pagestr.indexOf("ac_1_humidity") != -1) {
        get_current_value("ac", ac[0].humidity);
    } else if (pagestr.indexOf("ac_2_humidity") != -1) {
        get_current_value("ac", ac[0].humidity);
    }

