kfilipcic/ESP8266-smart-water-heater/platformIOproject/src/main.cpp
    else if (pagestr.indexOf("rform") != -1) {
        client.println(
            F("<html><head></head><form id='ruleForm' action='/rule' "
              "method='get'>"));
        client.println(
            F("<input type='text' name='starttimems' placeholder='Start time "
              "in ms'>"));
        client.println(
            F("<input type='text' name='starttime' placeholder='Start time'>"));
        client.println(
            F("<input type='text' name='endtime' placeholder='End time'>"));
        client.println(F("<input type='submit' value='Submit'></form></html>"));
    }
}

long long atoll(const char *ptr) {
    long long result = 0;
    while (*ptr && isdigit(*ptr)) {
        result *= 10;
        result += *ptr++ - '0';
    }
    return result;
}

void parseReceivedRequest(WiFiClient client) {
    theClock();
    // find query vars
    // Serial.println(" ");
    Serial.println("*************");
    Serial.println(queryBuffer);
    Serial.println("*************");

    //  GET /index.htm HTTP/1.1
    // GET / HTTP/1.1
    if (webParser.contains(queryBuffer, "GET / HTTP/1.1") ||
        webParser.contains(queryBuffer, ".html") ||
        webParser.contains(queryBuffer, "rule")) {
        theClock();
        // *********** Render HTML ***************
        // code not to render form request.
        // GET /index.htm?devicelist=1&nocache=549320.8093103021 HTTP/1.1
        if (loggedIn()) {
            // render html pages only if you've logged in
            webParser.clearBuffer(param_value, queryMax);
            webParser.fileUrl(queryBuffer, param_value);
            // default page
            theClock();

            if (webParser.contains(queryBuffer, "rule")) {
                client.println(httpHeader);

                webParser.parseQuery(queryBuffer, "starttimems", param_value);

                strcpy(queryStore, param_value);
                strcpy(firstParam, param_value);

                strtok(firstParam, "&");

                String substr = String(firstParam).substring(start_index);
                substr.toCharArray(queryStore, queryMax);

                startTimeMs = atoll(queryStore);

                client.print("{\n\t'startTimeMs': '");
                client.print(queryStore);
                client.print("',\n\t");

                webParser.clearBuffer(param_value, queryMax);
                webParser.parseQuery(queryBuffer, "starttime", param_value);
                strcpy(queryStore, param_value);
                startTimeHHmmMs = atoll(queryStore);

                client.print("'startTimeHHmmMs': '");
                client.print(queryStore);
                client.print("',\n\t");

                webParser.clearBuffer(param_value, queryMax);
                webParser.parseQuery(queryBuffer, "endtime", param_value);
                strcpy(queryStore, param_value);
                endTimeHHmmMs = atoll(queryStore);

                client.print("'endTimeHHmmMs': '");
                client.print(queryStore);
                client.print("'\n}");

                /*
                client.println();
                client.printf("%lld", startTimeMs);
                client.println();
                client.printf("%lld", startTimeHHmmMs);
                client.println();
                client.printf("%lld", endTimeHHmmMs);
                client.println();
                client.printf("%lld", curr_time_ms);
                client.println();*/

                return;
            }

            else if (strcmp(param_value, "/") == 0) {
                strcpy(param_value, "entry.html");
                client.println(F("HTTP/1.1 302 Found"));
                client.println(F("Location: /entry.html"));
            }
            // else load whatever
            // Serial.println(param_value);
            renderHtmlPage(param_value, client);
        } else {
            // loggin form
            char page[] = "logtut.html";
            // set it so it's not the same all the time.
            arduinoSession = millis();
            renderHtmlPage(page, client);

        }  // login
    } else {
        webParser.clearBuffer(param_value, queryMax);

        if (webParser.contains(queryBuffer, "login")) {
            webParser.parseQuery(queryBuffer, "username", param_value);

            char user[30];
            strcpy(user, param_value);

            webParser.clearBuffer(param_value, queryMax);
            webParser.parseQuery(queryBuffer, "password", param_value);
            char pass[30];
            strcpy(pass, param_value);

            // ***************** LOGIN ********************
            Serial.println(user);
            Serial.println(pass);

            if (webParser.compare(SECRET_AUTH_USER, user) &&
                webParser.compare(SECRET_AUTH_PASSWORD, pass)) {
                arduinoSession = millis();
                //***** print out Session ID
                // Serial.println(arduinoSession);
                // successful login and redirect to a page
                client.println(F("HTTP/1.1 302 Found"));
                client.print(F("Set-cookie: ARDUINOSESSIONID="));
                client.print(arduinoSession);
                client.println(F("; HttpOnly"));
                client.println(F("Location: /entry.html"));
                client.println();
            } else {
                // redirect back to login if wrong user / pass
                client.println(F("HTTP/1.1 302 Found"));
                client.println(F("Location: /logtut.html"));
                client.println();
            }  // if login
        } else if (webParser.contains(queryBuffer, "logout")) {
            // kill session ID
            arduinoSession = 1;
            // redirect back to login if wrong user / pass
            client.println(F("HTTP/1.1 302 Found"));
            client.println(F("Location: /logtut.html"));
            client.println();
        }

    }  // end main else
}  // end function

boolean loggedIn() {
    webParser.clearBuffer(param_value, queryMax);
    // going to need a parse cookie function
    webParser.parseQuery(queryBuffer, "ARDUINOSESSIONID", param_value);

    if (arduinoSession == atoll(param_value)) {
        return true;
    } else {
        return false;
    }
    return false;
}
